In [2]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [3]:
import pandas as pd
from sqlalchemy import create_engine

In [4]:
POSTGRES_USERNAME = "sahil"
POSTGRES_PASSWORD = "zxcvbnm"
POSTGRES_DBNAME = "postgres"
POSTGRES_HOST = "localhost"

url = 'postgresql://{}:{}@{}:{}/{}'.format(POSTGRES_USERNAME, POSTGRES_PASSWORD, POSTGRES_HOST, 5432, POSTGRES_DBNAME)
print(url)
engine = create_engine(url)

postgresql://sahil:zxcvbnm@localhost:5432/postgres

In [5]:
query1 = """
    CREATE TABLE product_groups (
    group_id serial PRIMARY KEY,
    group_name VARCHAR (255) NOT NULL
    );
"""
query2 = """
    CREATE TABLE products (
    product_id serial PRIMARY KEY,
    product_name VARCHAR (255) NOT NULL,
    price DECIMAL (11, 2),
    group_id INT NOT NULL,
    FOREIGN KEY (group_id) REFERENCES product_groups (group_id)
    );

    INSERT INTO product_groups (group_name)
    VALUES
    ('Smartphone'),
    ('Laptop'),
    ('Tablet');

    INSERT INTO products (product_name, group_id,price)
    VALUES
    ('Microsoft Lumia', 1, 200),
    ('HTC One', 1, 400),
    ('Nexus', 1, 500),
    ('iPhone', 1, 900),
    ('HP Elite', 2, 1200),
    ('Lenovo Thinkpad', 2, 700),
    ('Sony VAIO', 2, 700),
    ('Dell Vostro', 2, 800),
    ('iPad', 3, 700),
    ('Kindle Fire', 3, 150),
    ('Samsung Galaxy Tab', 3, 200);
 """
# engine

In [8]:
engine.execute(query1, con=engine)
engine.execute(query2, con=engine)

In [11]:
pd.read_sql_table("products", con=engine).head(20)

    product_id        product_name   price  group_id
0            1     Microsoft Lumia   200.0         1
1            2             HTC One   400.0         1
2            3               Nexus   500.0         1
3            4              iPhone   900.0         1
4            5            HP Elite  1200.0         2
5            6     Lenovo Thinkpad   700.0         2
6            7           Sony VAIO   700.0         2
7            8         Dell Vostro   800.0         2
8            9                iPad   700.0         3
9           10         Kindle Fire   150.0         3
10          11  Samsung Galaxy Tab   200.0         3

In [12]:
pd.read_sql_table("product_groups", con=engine).head()

   group_id  group_name
0         1  Smartphone
1         2      Laptop
2         3      Tablet

### Show average price for each group

In [23]:
query = """
SELECT product_groups.group_name, AVG (products.price)
FROM  products
INNER JOIN product_groups on products.group_id = product_groups.group_id
GROUP BY product_groups.group_name;
"""
# INNER JOIN product_groups USING (group_id)
ans = pd.read_sql_query(query, con=engine)
ans

   group_name    avg
0      Tablet  350.0
1  Smartphone  500.0
2      Laptop  850.0

### Window Function Syntax

window_function(arg1, arg2,..) OVER (PARTITION BY expression ORDER BY expression)

### Query returns the product name, the price, product group name, along with the average prices of each product group.

In [27]:
query = """
select product_name, price, group_name, avg(price) over (partition by group_name)
from products
inner join product_groups using (group_id);
"""
ans = pd.read_sql_query(query, con=engine)
ans

          product_name   price  group_name    avg
0             HP Elite  1200.0      Laptop  850.0
1      Lenovo Thinkpad   700.0      Laptop  850.0
2            Sony VAIO   700.0      Laptop  850.0
3          Dell Vostro   800.0      Laptop  850.0
4      Microsoft Lumia   200.0  Smartphone  500.0
5              HTC One   400.0  Smartphone  500.0
6                Nexus   500.0  Smartphone  500.0
7               iPhone   900.0  Smartphone  500.0
8                 iPad   700.0      Tablet  350.0
9          Kindle Fire   150.0      Tablet  350.0
10  Samsung Galaxy Tab   200.0      Tablet  350.0

### The ROW_NUMBER() function assigns a running serial number to rows in each partition. See the following query:

In [28]:
query = """
SELECT  product_name, group_name, price, ROW_NUMBER () OVER ( PARTITION BY group_name ORDER BY price )
FROM products
INNER JOIN product_groups USING (group_id);
"""
ans = pd.read_sql_query(query, con=engine)
ans

          product_name  group_name   price  row_number
0            Sony VAIO      Laptop   700.0           1
1      Lenovo Thinkpad      Laptop   700.0           2
2          Dell Vostro      Laptop   800.0           3
3             HP Elite      Laptop  1200.0           4
4      Microsoft Lumia  Smartphone   200.0           1
5              HTC One  Smartphone   400.0           2
6                Nexus  Smartphone   500.0           3
7               iPhone  Smartphone   900.0           4
8          Kindle Fire      Tablet   150.0           1
9   Samsung Galaxy Tab      Tablet   200.0           2
10                iPad      Tablet   700.0           3

### The DENSE_RANK() function assigns a running serial number to rows in each partition. See the following query:

In [29]:
query = """
SELECT  product_name, group_name, price, DENSE_RANK () OVER ( PARTITION BY group_name ORDER BY price )
FROM products
INNER JOIN product_groups USING (group_id);
"""
ans = pd.read_sql_query(query, con=engine)
ans

          product_name  group_name   price  dense_rank
0            Sony VAIO      Laptop   700.0           1
1      Lenovo Thinkpad      Laptop   700.0           1
2          Dell Vostro      Laptop   800.0           2
3             HP Elite      Laptop  1200.0           3
4      Microsoft Lumia  Smartphone   200.0           1
5              HTC One  Smartphone   400.0           2
6                Nexus  Smartphone   500.0           3
7               iPhone  Smartphone   900.0           4
8          Kindle Fire      Tablet   150.0           1
9   Samsung Galaxy Tab      Tablet   200.0           2
10                iPad      Tablet   700.0           3

### Select top 2 per group based on the least price

In [38]:
query = """
select * from 
    ( SELECT  product_name, group_name, price, RANK () OVER ( PARTITION BY group_name ORDER BY price ) as rank
    FROM products
    INNER JOIN product_groups USING (group_id)
    ) as foo
where foo.rank <=3;
"""
ans = pd.read_sql_query(query, con=engine)
ans

         product_name  group_name  price  rank
0           Sony VAIO      Laptop  700.0     1
1     Lenovo Thinkpad      Laptop  700.0     1
2         Dell Vostro      Laptop  800.0     3
3     Microsoft Lumia  Smartphone  200.0     1
4             HTC One  Smartphone  400.0     2
5               Nexus  Smartphone  500.0     3
6         Kindle Fire      Tablet  150.0     1
7  Samsung Galaxy Tab      Tablet  200.0     2
8                iPad      Tablet  700.0     3

In [62]:
query1 = """
    DROP TABLE product_groups2;
    CREATE TABLE product_groups2 (
    group_id serial PRIMARY KEY,
    group_name VARCHAR (255) NOT NULL
    );
"""
query2 = """
    DROP TABLE products2;
    CREATE TABLE products2 (
    product_id serial PRIMARY KEY,
    product_name VARCHAR (255) NOT NULL,
    price DECIMAL (11, 2),
    group_id INT NOT NULL,
    sell_time TIMESTAMP,
    FOREIGN KEY (group_id) REFERENCES product_groups (group_id)
    );

    INSERT INTO product_groups2 (group_name)
    VALUES
    ('Smartphone'),
    ('Laptop'),
    ('Tablet');

    INSERT INTO products2 (product_name, group_id,price, sell_time)
    VALUES
    ('Microsoft Lumia', 1, 200, '2019-04-11 08:50:16'),
    ('HTC One', 2, 400, '2019-04-11 08:49:14'),
    ('Nexus', 1, 500, '2019-04-11 08:49:16'),
    ('iPhone', 1, 900, '2019-04-11 08:51:16'),
    ('HP Elite', 2, 1200, '2019-04-11 08:50:26'),
    ('Lenovo Thinkpad', 2, 700, '2019-04-11 08:48:16'),
    ('Sony VAIO', 2, 700, '2019-04-11 08:48:16'),
    ('Dell Vostro', 2, 800, '2019-04-11 08:50:26'),
    ('iPad', 3, 700, '2019-04-11 08:49:16'),
    ('Kindle Fire', 3, 150, '2019-04-11 08:51:16'),
    ('Samsung Galaxy Tab', 3, 200, '2019-04-11 08:50:16');
 """
# engine

In [63]:
engine.execute(query1)
engine.execute(query2)

In [64]:
pd.read_sql_table("products2", con=engine).head(20)

    product_id        product_name   price  group_id           sell_time
0            1     Microsoft Lumia   200.0         1 2019-04-11 08:50:16
1            2             HTC One   400.0         2 2019-04-11 08:49:14
2            3               Nexus   500.0         1 2019-04-11 08:49:16
3            4              iPhone   900.0         1 2019-04-11 08:51:16
4            5            HP Elite  1200.0         2 2019-04-11 08:50:26
5            6     Lenovo Thinkpad   700.0         2 2019-04-11 08:48:16
6            7           Sony VAIO   700.0         2 2019-04-11 08:48:16
7            8         Dell Vostro   800.0         2 2019-04-11 08:50:26
8            9                iPad   700.0         3 2019-04-11 08:49:16
9           10         Kindle Fire   150.0         3 2019-04-11 08:51:16
10          11  Samsung Galaxy Tab   200.0         3 2019-04-11 08:50:16

In [70]:
query = """ select *,date_trunc('minute', sell_time) from products2;"""
ans = pd.read_sql_query(query, con=engine)
ans

,product_id,product_name,price,group_id,sell_time,date_trunc
0,1,Microsoft Lumia,200.0,1,2019-04-11 08:50:16,2019-04-11 08:50:00
1,2,HTC One,400.0,2,2019-04-11 08:49:14,2019-04-11 08:49:00
2,3,Nexus,500.0,1,2019-04-11 08:49:16,2019-04-11 08:49:00
3,4,iPhone,900.0,1,2019-04-11 08:51:16,2019-04-11 08:51:00
4,5,HP Elite,1200.0,2,2019-04-11 08:50:26,2019-04-11 08:50:00
5,6,Lenovo Thinkpad,700.0,2,2019-04-11 08:48:16,2019-04-11 08:48:00
6,7,Sony VAIO,700.0,2,2019-04-11 08:48:16,2019-04-11 08:48:00
7,8,Dell Vostro,800.0,2,2019-04-11 08:50:26,2019-04-11 08:50:00
8,9,iPad,700.0,3,2019-04-11 08:49:16,2019-04-11 08:49:00
9,10,Kindle Fire,150.0,3,2019-04-11 08:51:16,2019-04-11 08:51:00
10,11,Samsung Galaxy Tab,200.0,3,2019-04-11 08:50:16,2019-04-11 08:50:00

In [69]:
query = """ 
select group_id, min(price), max(price), avg(price), date_trunc('minute', sell_time) as date_minute 
from products2
group by group_id, date_minute
order by date_minute; 
"""
ans = pd.read_sql_query(query, con=engine)
ans

   group_id    min     max     avg         date_minute
0         2  700.0   700.0   700.0 2019-04-11 08:48:00
1         1  500.0   500.0   500.0 2019-04-11 08:49:00
2         2  400.0   400.0   400.0 2019-04-11 08:49:00
3         3  700.0   700.0   700.0 2019-04-11 08:49:00
4         1  200.0   200.0   200.0 2019-04-11 08:50:00
5         2  800.0  1200.0  1000.0 2019-04-11 08:50:00
6         3  200.0   200.0   200.0 2019-04-11 08:50:00
7         1  900.0   900.0   900.0 2019-04-11 08:51:00
8         3  150.0   150.0   150.0 2019-04-11 08:51:00

In [75]:
products2 = pd.read_sql_table("products2", con=engine)
products2 = products2.drop('product_id',axis=1)
products2

          product_name   price  group_id           sell_time
0      Microsoft Lumia   200.0         1 2019-04-11 08:50:16
1              HTC One   400.0         2 2019-04-11 08:49:14
2                Nexus   500.0         1 2019-04-11 08:49:16
3               iPhone   900.0         1 2019-04-11 08:51:16
4             HP Elite  1200.0         2 2019-04-11 08:50:26
5      Lenovo Thinkpad   700.0         2 2019-04-11 08:48:16
6            Sony VAIO   700.0         2 2019-04-11 08:48:16
7          Dell Vostro   800.0         2 2019-04-11 08:50:26
8                 iPad   700.0         3 2019-04-11 08:49:16
9          Kindle Fire   150.0         3 2019-04-11 08:51:16
10  Samsung Galaxy Tab   200.0         3 2019-04-11 08:50:16

In [106]:
file_number = 1
start = 1
end = 3

In [109]:
fileName = "./batch_data2/batch_" + str(file_number) + ".csv"
# with open(fileName, "w") as f:
df = products2.iloc[start:end, :]
df.to_csv(fileName, index=False)
start = end
end = end + 3
file_number = file_number + 1